0/dens
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      dens;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    TOP      
    {
        type            calculated;
        value           $internalField;
    }

    BOT      
    {
        type            calculated;
        value           $internalField;
    }

    LEFT
    {
        type            calculated;
        value           $internalField;
    }

    RIGHT      
    {
        type            calculated;
        value           $internalField;
    }

    PLANE      
    {
         type            calculated;
        value           $internalField;
    }

    SYMM    
    {
        type            empty;
    }
}

// ************************************************************************* //
